
// Сумма чисел--------------------------------------------------------------------------------------------------
// const p1 = 8;
// const getSumNum = (p) => {
//     let s = 0;
//     for (i = 0; i <= p; i++){
//     s = s + i;
//     }
//     return s; 
// }
// console.log(getSumNum(p1));


// Произведение чисел--------------------------------------------------------------------------------------------------
// const p2 = 8;
// const getMultiplyNum = (p) => {
//     let s = 1;
//     for (i = 1; i <= p; i++){
//     s = s * i;
//     }
//     return s; 
// }
// console.log(getMultiplyNum(p2));



// Простое число--------------------------------------------------------------------------------------------------
// const p3 = 100;
// getEvenOdd = (p) => {
//         for(let i = 1; i <= p; i++){
//             if(i % 2 == 0){
//                 console.log('Четное число:' + ' ' , i);
//             }
//             else{
//                 console.log('Нечетное число:' + ' ' , i);
//             }
//         }
//     return;
// }
// getEvenOdd(p3)

// Чёт-нечёт2--------------------------------------------------------------------------------------------------
// const p3 = 100;
// getEvenOdd = (p) => {
//     let even = [];
//     let odd = [];
//         for(let i = 1; i <= p; i++){
//             if(i % 2 == 0){
//                 even.push(i);
//             }
//             else{
//                 odd.push(i)
//             }
//         }
//     return`Чётные : ${even.toString()}\nНечётные : ${odd.toString()}`
// }
// console.log(
//  getEvenOdd(p3));



// Простое число--------------------------------------------------------------------------------------------------
// const p4 = 88;
// isPrimeNum = (p) => {
//     let checkPrime = true;
//     for (let i = 2; i < p; i++){
//         if (p % i === 0){
//             checkPrime = false;
//             break;
//         }
//     }
//     if (checkPrime) {
//         return `${p} - Простое число`;
//     }
//     else {
//         return `${p} - Составное число`;
//     }
// }
// isPrimeNum(p4);
// не работает----------------------------------------------------------------------------------------------------------


// Таблица умножения числа-------------------------------------------------------------------------------------------------
// const p5 = 9;
// writeTableMulitiply = (p) => {
//     let res = 0;
//     for( i = 1; i <= 10; i++){
//         res = p * i, console.log(p + ' x ' + i + ' = ' + res)
//     }
   
// }
// writeTableMulitiply(p5);

